000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ЖурналСобытий/ЖурналСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЖурналСобытий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Данные</name>
    <type>
      <types>AnyRef</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеПредставление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Компьютер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъектМетаданных</name>
    <comment>Имя ОбъектМетаданных</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Проверен</name>
    <comment>Воздействие проверено сторонним процессом.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Событие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>EnumRef.УровеньЖурналаРегистрации</types>
    </type>
  </resources>
  <resources>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>ЭлементСтруктуры</name>
    <type>
      <types>CatalogRef.СтруктураУзлов</types>
    </type>
  </attributes>
  <dimensions>
    <name>КодУзлаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Индекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ЖурналСобытий/RecordSetModule.bsl
//	LNK 09.12.2016 09:16:08
Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

//	---------------------------------------------------------------------------------------

	Индекс = 0;

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		ЗаписьНабора.Период        = Отбор.Период.Значение;
		ЗаписьНабора.КодУзлаОбмена = Отбор.КодУзлаОбмена.Значение;

		Если НЕ Отбор.Индекс.Использование Тогда

				ЗаписьНабора.Индекс	= Индекс;

		Иначе	ЗаписьНабора.Индекс	= Отбор.Индекс.Значение;

		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ЗаписьНабора.Пользователь) Тогда

			ЗаписьНабора.Пользователь = Пользователи.АвторизованныйПользователь();

		КонецЕсли;

		Если ПустаяСтрока(ЗаписьНабора.Компьютер) Тогда

			ЗаписьНабора.Компьютер = ИмяКомпьютера();

		КонецЕсли;

		Если ПустаяСтрока(ЗаписьНабора.ДанныеПредставление) Тогда

			ЗаписьНабора.ДанныеПредставление = СокрЛП(ЗаписьНабора.Данные);

		КонецЕсли;

		Если ЗаписьНабора.ЭлементСтруктуры.Пустая() Тогда

			Если ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Свойство("ЭлементСтруктуры") Тогда

				ЗаписьНабора.ЭлементСтруктуры = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ЭлементСтруктуры;

			КонецЕсли;

		КонецЕсли;

		Индекс = Индекс + 1;

	КонецЦикла;

КонецПроцедуры
